In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'Name': ['Magdel', 'Hazel', 'Jeff'],
                   'Age': [17, 13, 14],
                   'Weight': [48, 38, 49], 
                   'Height': [150, 140, 160]})

In [3]:
df

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160

In [4]:
df.dtypes

Name      object
Age        int64
Weight     int64
Height     int64
dtype: object

In [5]:
df.size

12

In [6]:
df.shape

(3, 4)

In [7]:
df.head()

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160

In [8]:
df.tail()

     Name  Age  Weight  Height
0  Magdel   17      48     150
1   Hazel   13      38     140
2    Jeff   14      49     160

In [9]:
df.min()

Name      Hazel
Age          13
Weight       38
Height      140
dtype: object

In [10]:
df.min(1)

0    17
1    13
2    14
dtype: int64

In [11]:
df.max()

Name      Magdel
Age           17
Weight        49
Height       160
dtype: object

In [12]:
df.max(1)

0    150
1    140
2    160
dtype: int64

In [13]:
df.mean()

Age        14.666667
Weight     45.000000
Height    150.000000
dtype: float64

In [14]:
df.mean(1)

0    71.666667
1    63.666667
2    74.333333
dtype: float64

In [15]:
df.median()

Age        14.0
Weight     48.0
Height    150.0
dtype: float64

In [16]:
df.median(1)

0    48.0
1    38.0
2    49.0
dtype: float64

In [17]:
df.std()

Age        2.081666
Weight     6.082763
Height    10.000000
dtype: float64

In [18]:
df.std(1)

0    69.586876
1    67.278030
2    76.225543
dtype: float64

In [19]:
df.describe()

             Age     Weight  Height
count   3.000000   3.000000     3.0
mean   14.666667  45.000000   150.0
std     2.081666   6.082763    10.0
min    13.000000  38.000000   140.0
25%    13.500000  43.000000   145.0
50%    14.000000  48.000000   150.0
75%    15.500000  48.500000   155.0
max    17.000000  49.000000   160.0

In [20]:
df = pd.DataFrame({'Name': ['Magdel', 'Hazel', 'Jeff'],
                   'Age': [17, 13, 14],
                   'Weight': [48, 38, 49], 
                   'Height': [150, 140, 160]}, index = [4, 2, 8])

In [21]:
df

     Name  Age  Weight  Height
4  Magdel   17      48     150
2   Hazel   13      38     140
8    Jeff   14      49     160

In [22]:
df = df.sort_index()

In [23]:
df

     Name  Age  Weight  Height
2   Hazel   13      38     140
4  Magdel   17      48     150
8    Jeff   14      49     160

In [24]:
df = df.sort_index(ascending = False)

In [25]:
df

     Name  Age  Weight  Height
8    Jeff   14      49     160
4  Magdel   17      48     150
2   Hazel   13      38     140

In [26]:
df = pd.DataFrame([[1, 4, 7],[64, 67, 45], [46, 23, 34]],
                  index = [5, 3, 6], 
                  columns = ['colA', 'colB', 'colC'])

In [27]:
df

   colA  colB  colC
5     1     4     7
3    64    67    45
6    46    23    34

In [28]:
df = df.sort_values(by = 'colA')

In [29]:
df

   colA  colB  colC
5     1     4     7
6    46    23    34
3    64    67    45

In [30]:
df

   colA  colB  colC
5     1     4     7
6    46    23    34
3    64    67    45

In [31]:
df = pd.DataFrame({'Name': ['Magdel', 'Hazel', 'Jeff'],
                   'Age': [17, 13, 14],
                   'Weight': [48, 38, 49], 
                   'Height': [150, 140, 160]}, index = [4, 2, 8])

In [32]:
df

     Name  Age  Weight  Height
4  Magdel   17      48     150
2   Hazel   13      38     140
8    Jeff   14      49     160

In [33]:
df.sort_index()

     Name  Age  Weight  Height
2   Hazel   13      38     140
4  Magdel   17      48     150
8    Jeff   14      49     160

In [34]:
df.sort_index(ascending = False)

     Name  Age  Weight  Height
8    Jeff   14      49     160
4  Magdel   17      48     150
2   Hazel   13      38     140

In [35]:
df.sort_values(by = 'Name')

     Name  Age  Weight  Height
2   Hazel   13      38     140
8    Jeff   14      49     160
4  Magdel   17      48     150

In [36]:
s = pd.Series(['Magdel', 'Hazel', 'Jacob'  ])

In [37]:
s.str.upper()

0    MAGDEL
1     HAZEL
2     JACOB
dtype: object

In [38]:
s.str.lower()

0    magdel
1     hazel
2     jacob
dtype: object

In [39]:
s.str.len()

0    6
1    5
2    5
dtype: int64

In [40]:
df = pd.DataFrame([{'a': 9, 'b': 8, 'c': 2}, 
                  {'b': 9, 'e': 6, 'c': 3}, 
                  {'a': 8, 'e': 2, 'c': 4}])

In [41]:
df

     a    b  c    e
0  9.0  8.0  2  NaN
1  NaN  9.0  3  6.0
2  8.0  NaN  4  2.0

In [42]:
df.isnull()

       a      b      c      e
0  False  False  False   True
1   True  False  False  False
2  False   True  False  False

In [43]:
df['a'].isnull()

0    False
1     True
2    False
Name: a, dtype: bool

In [44]:
df.notnull()

       a      b     c      e
0   True   True  True  False
1  False   True  True   True
2   True  False  True   True

In [45]:
df['a'].notnull()

0     True
1    False
2     True
Name: a, dtype: bool

In [46]:
df.fillna(0)

     a    b  c    e
0  9.0  8.0  2  0.0
1  0.0  9.0  3  6.0
2  8.0  0.0  4  2.0

In [47]:
df.fillna(method = 'ffill')

     a    b  c    e
0  9.0  8.0  2  NaN
1  9.0  9.0  3  6.0
2  8.0  9.0  4  2.0

In [48]:
df.fillna(method = 'bfill')

     a    b  c    e
0  9.0  8.0  2  6.0
1  8.0  9.0  3  6.0
2  8.0  NaN  4  2.0

In [49]:
df.dropna()

Empty DataFrame
Columns: [a, b, c, e]
Index: []

In [50]:
df

     a    b  c    e
0  9.0  8.0  2  NaN
1  NaN  9.0  3  6.0
2  8.0  NaN  4  2.0

In [51]:
df.dropna(axis = 0)

Empty DataFrame
Columns: [a, b, c, e]
Index: []

In [52]:
df.dropna(axis = 1)

   c
0  2
1  3
2  4

In [53]:
s = pd.Series(['Magdel', 'Hazel', 'Jacob'  ])

In [54]:
s.str.get_dummies()

   Hazel  Jacob  Magdel
0      0      0       1
1      1      0       0
2      0      1       0

In [55]:
df

     a    b  c    e
0  9.0  8.0  2  NaN
1  NaN  9.0  3  6.0
2  8.0  NaN  4  2.0

In [56]:
df.fillna(df.mean())

     a    b  c    e
0  9.0  8.0  2  4.0
1  8.5  9.0  3  6.0
2  8.0  8.5  4  2.0